In [3]:
import numpy as np
import pandas as pd

## Series

In [4]:
benimSozlugum = {"Atıl" : 39, "Ayşe" : 40, "Fatma" : 47}

In [5]:
pd.Series(benimSozlugum)

Atıl     39
Ayşe     40
Fatma    47
dtype: int64

## Data Frame

In [6]:
data = np.random.randn(3,4)

In [7]:
data

array([[-0.64716949,  0.15532654, -0.20800929, -0.86006842],
       [-0.29147711,  0.65589736,  0.58553762,  1.17871756],
       [-1.95791399,  0.4666087 , -0.16304807, -1.0945222 ]])

In [9]:
dataFrame = pd.DataFrame(data)

In [11]:
dataFrame

          0         1         2         3
0 -0.647169  0.155327 -0.208009 -0.860068
1 -0.291477  0.655897  0.585538  1.178718
2 -1.957914  0.466609 -0.163048 -1.094522

In [13]:
dataFrame[0]

0   -0.647169
1   -0.291477
2   -1.957914
Name: 0, dtype: float64

In [20]:
yeniDataFrame = pd.DataFrame(data,index=["Atıl", "Ayşe", "Fatma"], columns=["Maas", "Yas", "Tecrube", "Saat"])

In [24]:
yeniDataFrame

           Maas       Yas   Tecrube      Saat
Atıl  -0.647169  0.155327 -0.208009 -0.860068
Ayşe  -0.291477  0.655897  0.585538  1.178718
Fatma -1.957914  0.466609 -0.163048 -1.094522

In [26]:
yeniDataFrame["Yas"]

Atıl     0.155327
Ayşe     0.655897
Fatma    0.466609
Name: Yas, dtype: float64

In [27]:
yeniDataFrame[["Maas", "Yas"]]

           Maas       Yas
Atıl  -0.647169  0.155327
Ayşe  -0.291477  0.655897
Fatma -1.957914  0.466609

In [29]:
yeniDataFrame["Atıl"]

KeyError: 'Atıl'

In [30]:
yeniDataFrame.loc["Atıl"]

Maas      -0.647169
Yas        0.155327
Tecrube   -0.208009
Saat      -0.860068
Name: Atıl, dtype: float64

In [31]:
yeniDataFrame["Emeklilik"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [32]:
yeniDataFrame["Emeklilik"]

Atıl     0.310653
Ayşe     1.311795
Fatma    0.933217
Name: Emeklilik, dtype: float64

In [38]:
yeniDataFrame

           Maas       Yas   Tecrube      Saat  Emeklilik
Atıl  -0.647169  0.155327 -0.208009 -0.860068   0.310653
Ayşe  -0.291477  0.655897  0.585538  1.178718   1.311795
Fatma -1.957914  0.466609 -0.163048 -1.094522   0.933217

In [43]:
yeniDataFrame.drop("Emeklilik", axis=1)

           Maas       Yas   Tecrube      Saat
Atıl  -0.647169  0.155327 -0.208009 -0.860068
Ayşe  -0.291477  0.655897  0.585538  1.178718
Fatma -1.957914  0.466609 -0.163048 -1.094522

In [44]:
yeniDataFrame

           Maas       Yas   Tecrube      Saat  Emeklilik
Atıl  -0.647169  0.155327 -0.208009 -0.860068   0.310653
Ayşe  -0.291477  0.655897  0.585538  1.178718   1.311795
Fatma -1.957914  0.466609 -0.163048 -1.094522   0.933217

In [45]:
yeniDataFrame.drop("Emeklilik", axis=1,inplace=True)

In [46]:
yeniDataFrame

           Maas       Yas   Tecrube      Saat
Atıl  -0.647169  0.155327 -0.208009 -0.860068
Ayşe  -0.291477  0.655897  0.585538  1.178718
Fatma -1.957914  0.466609 -0.163048 -1.094522

## Pandas Operasyonlar

In [47]:
sozlukVerisi = {"Pazartesi" : [30,29,np.nan], "Ankara" : [20,np.nan,25],"Izmir" : [35,34,37]}

In [48]:
sozlukVerisi

{'Pazartesi': [30, 29, nan], 'Ankara': [20, nan, 25], 'Izmir': [35, 34, 37]}

In [50]:
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [51]:
havaDurumuDataFrame

   Pazartesi  Ankara  Izmir
0       30.0    20.0     35
1       29.0     NaN     34
2        NaN    25.0     37

In [53]:
havaDurumuDataFrame.dropna()

   Pazartesi  Ankara  Izmir
0       30.0    20.0     35

In [54]:
havaDurumuDataFrame

   Pazartesi  Ankara  Izmir
0       30.0    20.0     35
1       29.0     NaN     34
2        NaN    25.0     37

In [55]:
import pandas as pd

# Örnek DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'San Francisco', 'Los Angeles']
}

df = pd.DataFrame(data)

# Sütun silme
df_silinen_sutun = df.drop('City', axis=1)  # 'City' sütununu silecek

print("Orijinal DataFrame:")
print(df)

print("\nDataFrame'den Sütun Silme:")
print(df_silinen_sutun)

Orijinal DataFrame:
      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

DataFrame'den Sütun Silme:
      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [56]:
havaDurumuDataFrame

   Pazartesi  Ankara  Izmir
0       30.0    20.0     35
1       29.0     NaN     34
2        NaN    25.0     37

In [59]:
havaDurumuDataFrame.drop("Ankara", axis=1)

   Pazartesi  Izmir
0       30.0     35
1       29.0     34
2        NaN     37

In [60]:
havaDurumuDataFrame

   Pazartesi  Ankara  Izmir
0       30.0    20.0     35
1       29.0     NaN     34
2        NaN    25.0     37

In [63]:
yeniVeri = {"Pazartesi" : [30,29,np.nan], "Ankara" : [20,np.nan,25],"Izmir" : [35,34,37], "Antalya" : [40,np.nan,np.nan]}
yeniVeri = pd.DataFrame(yeniVeri)

In [64]:
yeniVeri

   Pazartesi  Ankara  Izmir  Antalya
0       30.0    20.0     35     40.0
1       29.0     NaN     34      NaN
2        NaN    25.0     37      NaN

In [66]:
yeniVeri.dropna(axis=1, thresh=2)

   Pazartesi  Ankara  Izmir
0       30.0    20.0     35
1       29.0     NaN     34
2        NaN    25.0     37

yeniVeri

In [68]:
yeniVeri.fillna(20)

   Pazartesi  Ankara  Izmir  Antalya
0       30.0    20.0     35     40.0
1       29.0    20.0     34     20.0
2       20.0    25.0     37     20.0

In [70]:
yeniVeri

   Pazartesi  Ankara  Izmir  Antalya
0       30.0    20.0     35     40.0
1       29.0     NaN     34      NaN
2        NaN    25.0     37      NaN

## groupby